tap "homebrew/bundle"
brew "bat"
brew "chezmoi"
brew "curl"
brew "git"
brew "lsd"
brew "jq"
brew "navi"
brew "peco"
brew "pyenv"
brew "starship"
brew "tig"
brew "tfenv"
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "zed"
