tap "databricks/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "supabase/tap"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "glib"
brew "chezmoi"
brew "curl"
brew "direnv"
brew "exa"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "mise"
brew "navi"
brew "neovim"
brew "openvino"
brew "peco"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "pyenv"
brew "starship"
brew "tfenv"
brew "tig"
brew "tmux"
brew "databricks/tap/databricks"
brew "supabase/tap/supabase"
cask "alacritty"
cask "font-hack-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "monitorcontrol"
cask "ngrok"
cask "zed"
go "github.com/wailsapp/wails/v2/cmd/wails"
